; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v11 ?v9)
             (pred_11 ?v4 ?v3)
             (pred_5 ?v11 ?v3)
             (pred_2 ?v13 ?v11 )
	     (pred_7 ?v11)
             (pred_10 ?v10)
             (pred_3 ?v4)
             (pred_8 ?v3)
             (pred_4 ?v11)
             (pred_6 ?v4)
             (pred_9 ?v11)
             (pred_1 ))



(:action op_5
:parameters (?v5 ?v1 ?v2 ?v7)
:precondition (and (pred_10 ?v5) (pred_10 ?v1) (pred_3 ?v2) (pred_8 ?v7)
          (pred_12 ?v5 ?v1) (pred_11 ?v2 ?v7)
                   (pred_5 ?v1 ?v7) (pred_7 ?v5) 
                   (pred_4 ?v1) (pred_6 ?v2))
:effect (and  (pred_9 ?v1) (not (pred_4 ?v1))))


(:action op_3
:parameters (?v5 ?v8)
:precondition (and (pred_10 ?v5) (pred_10 ?v8)
               (pred_7 ?v5) (pred_12 ?v5 ?v8) (pred_9 ?v8))
:effect (and (pred_7 ?v8) (not (pred_7 ?v5))))

(:action op_4
:parameters (?v5 ?v2)
:precondition (and (pred_10 ?v5) (pred_3 ?v2) 
                  (pred_7 ?v5) (pred_2 ?v2 ?v5) (pred_1 ))
:effect (and (pred_6 ?v2)
   (not (pred_2 ?v2 ?v5)) (not (pred_1 ))))


(:action op_1
:parameters (?v5 ?v6 ?v12)
:precondition (and (pred_10 ?v5) (pred_3 ?v6) (pred_3 ?v12)
                  (pred_7 ?v5) (pred_6 ?v12) (pred_2 ?v6 ?v5))
:effect (and (pred_6 ?v6) (pred_2 ?v12 ?v5)
        (not (pred_6 ?v12)) (not (pred_2 ?v6 ?v5))))

(:action op_2
:parameters (?v5 ?v2)
:precondition (and (pred_10 ?v5) (pred_3 ?v2) 
                  (pred_7 ?v5) (pred_6 ?v2))
:effect (and (pred_1 ) (pred_2 ?v2 ?v5) (not (pred_6 ?v2)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_18 obj_13 obj_07 obj_17 obj_08 obj_14 obj_21 obj_19 obj_20 obj_04 obj_15 obj_01 obj_12 obj_09 obj_11
    obj_16 obj_22 obj_05
    obj_06 obj_10 obj_03
    )

    (:init
       (pred_1)

       (pred_10 obj_02)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_10 obj_14)
       (pred_10 obj_21)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_04)
       (pred_10 obj_15)
       (pred_10 obj_01)
       (pred_10 obj_12)
       (pred_10 obj_09)
       (pred_10 obj_11)
       (pred_8 obj_16)
       (pred_8 obj_22)
       (pred_8 obj_05)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_3 obj_03)

       (pred_12 obj_02 obj_17)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_18 obj_13)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_13 obj_14)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_13 obj_18)
       (pred_12 obj_07 obj_21)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_17 obj_19)
       (pred_12 obj_17 obj_08)
       (pred_12 obj_17 obj_02)
       (pred_12 obj_08 obj_20)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_08 obj_18)
       (pred_12 obj_08 obj_17)
       (pred_12 obj_14 obj_04)
       (pred_12 obj_14 obj_21)
       (pred_12 obj_14 obj_13)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_07)
       (pred_12 obj_21 obj_14)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_20)
       (pred_12 obj_19 obj_17)
       (pred_12 obj_20 obj_12)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_20 obj_08)
       (pred_12 obj_20 obj_19)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_04 obj_15)
       (pred_12 obj_04 obj_14)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_15 obj_11)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_15 obj_04)
       (pred_12 obj_01 obj_12)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_12 obj_09)
       (pred_12 obj_12 obj_20)
       (pred_12 obj_12 obj_01)
       (pred_12 obj_09 obj_11)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_09 obj_12)
       (pred_12 obj_11 obj_15)
       (pred_12 obj_11 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_12)
       (pred_4 obj_15)
       (pred_5  obj_01 obj_16)
       (pred_5  obj_12 obj_22)
       (pred_5  obj_15 obj_05)
       (pred_9 obj_02)
       (pred_9 obj_18)
       (pred_9 obj_13)
       (pred_9 obj_07)
       (pred_9 obj_17)
       (pred_9 obj_08)
       (pred_9 obj_14)
       (pred_9 obj_21)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_04)
       (pred_9 obj_09)
       (pred_9 obj_11)

       (pred_11  obj_06 obj_16)
       (pred_11  obj_10 obj_22)
       (pred_11  obj_03 obj_05)
       (pred_2 obj_06 obj_21)
       (pred_2 obj_10 obj_11)
       (pred_2 obj_03 obj_13)
       (pred_7 obj_20)
    )

    (:goal (and
       (pred_2 obj_03 obj_19)
    ))
(:constraints
  (always (not (pred_7 obj_18)))
)
)

; plan
1. (op_3 obj_20 obj_08)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_08)
   goals met: 0 of 1
2. (op_3 obj_08 obj_14)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_14)
   goals met: 0 of 1
3. (op_3 obj_14 obj_13)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_13)
   goals met: 0 of 1
4. (op_4 obj_13 obj_03)
   deleted: (pred_2 obj_03 obj_13) (pred_1)
   added: (pred_6 obj_03)
   goals met: 0 of 1
5. (op_3 obj_13 obj_14)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_14)
   goals met: 0 of 1
6. (op_3 obj_14 obj_08)
   deleted: (pred_7 obj_14)
   added: (pred_7 obj_08)
   goals met: 0 of 1
7. (op_3 obj_08 obj_17)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_17)
   goals met: 0 of 1
8. (op_3 obj_17 obj_19)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_19)
   goals met: 0 of 1
9. (op_2 obj_19 obj_03)
   deleted: (pred_6 obj_03)
   added: (pred_1) (pred_2 obj_03 obj_19)
   goals met: 1 of 1
